# Level Up - week3

## 여러 특성을 지닌 데이터의 Decision Tree

카테고리 특성, 연속적 특성을 모두 가진 데이터의 의사결정나무 만들기

In [24]:
data = {
    'weight': [28, 2, 9, 6],
    'movable': [True, True, True, False],
    'category': ['animal', 'plant', 'animal', 'plant']
}

In [33]:
# 코드작성이 끝나면 target_index를 0부터 3까지 변경하면서 실행해보세요.
target_index = 0
target_names = ['1번 생물', '2번 생물', '3번 생물', '4번 생물']

print(target_names[target_index], ': 동물/식물을 분류합니다.')

# 움직이는지 확인
if data['movable'][target_index]: # 움직인다
    # 무게 확인
    if data['weight'][target_index] <= 6: # 무게 <= 6
        print('plant')
    else: # 무게 > 6
        print('animal')
else: # 움직이지 못한다
    print('plant')

1번 생물 : 동물/식물을 분류합니다.
animal

---
## Cabin

## 혼자실습$1
### Cabin의 객실 알파벳만 남기기 (첫글자)

In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv('data/train.csv')
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [6]:
# 테스트셋
df_test = pd.read_csv('data/test.csv')
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [7]:
df['Cabin'] = df['Cabin'].str[0]
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C,S

In [11]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C,S

In [9]:
df['Cabin'] = df['Cabin'].fillna('C')

# 테스트셋에도 똑같이 적용
df_test['Cabin'] = df_test['Cabin'].str[0]
df_test['Cabin'] = df_test['Cabin'].fillna('C')

df_test.isnull().sum()

PassengerId     0
Pclass          0
Name            0
Sex             0
Age            86
SibSp           0
Parch           0
Ticket          0
Fare            1
Cabin           0
Embarked        0
dtype: int64

## 혼자실습$2
### Cabin의 문자값 데이터를 숫자로 변환

In [10]:
df['Cabin'].value_counts()

C    746
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin, dtype: int64

In [12]:
# training set
df['Cabin'] = df['Cabin'].map({
    'C': 0,
    'B': 1,
    'D': 2,
    'E': 3,
    'A': 4,
    'F': 5,
    'G': 6,
    'T': 7
})

df['Cabin'].value_counts()

0    746
1     47
2     33
3     32
4     15
5     13
6      4
7      1
Name: Cabin, dtype: int64

In [13]:
# 테스트셋도 똑같이 적용
df_test['Cabin'] = df_test['Cabin'].map({
    'C': 0,
    'B': 1,
    'D': 2,
    'E': 3,
    'A': 4,
    'F': 5,
    'G': 6,
    'T': 7
})

df_test['Cabin'].value_counts()

0    362
1     18
2     13
3      9
5      8
4      7
6      1
Name: Cabin, dtype: int64

---
## 빈칸(NaN)을 더 현명하게 처리하기

## 혼자실습$1
### Name에서 유용한 정보 남기기

In [14]:
df[['Name', 'Age']].head(10)

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0
5                                   Moran, Mr. James   NaN
6                            McCarthy, Mr. Timothy J  54.0
7                     Palsson, Master. Gosta Leonard   2.0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                Nasser, Mrs. Nicholas (Adele Achem)  14.0

In [15]:
# 쉬운 방법) 전체 나이 평균을 넣기 - stage2 기준
# df['Age'].fillna(df['Age'].mean())

# 개선된 방법) 이름에 들어가는 Mr. Mrs. Miss. 타이틀 정보 뽑기
df.loc[ df['Name'].str.contains('Mr\.'), 'Name' ] = 'Mr'
df.loc[ df['Name'].str.contains('Mrs\.'), 'Name' ] = 'Mrs'
df.loc[ df['Name'].str.contains('Miss\.'), 'Name' ] = 'Miss'
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Mr,male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,Mrs,female,38.0,1,0,PC 17599,71.2833,0,C
2,3,1,3,Miss,female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,Mrs,female,35.0,1,0,113803,53.1000,0,S
4,5,0,3,Mr,male,35.0,0,0,373450,8.0500,0,S

In [16]:
df['Name'] = df['Name'].map({
    'Mr': 0,
    'Mrs': 1,
    'Miss': 2
})

df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,0.0,male,22.0,1,0,A/5 21171,7.2500,0,S
1,2,1,1,1.0,female,38.0,1,0,PC 17599,71.2833,0,C
2,3,1,3,2.0,female,26.0,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,1.0,female,35.0,1,0,113803,53.1000,0,S
4,5,0,3,0.0,male,35.0,0,0,373450,8.0500,0,S
5,6,0,3,0.0,male,NaN,0,0,330877,8.4583,0,Q
6,7,0,1,0.0,male,54.0,0,0,17463,51.8625,3,S
7,8,0,3,NaN,male,2.0,3,1,349909,21.0750,0,S
8,9,1,3,1.0,female,27.0,0,2,347742,11.1333,0,S
9,10,1,2,1.0,female,14.0,1,0,237736,30.0708,0,C

## 혼자실습$2
### Name의 빈칸(NaN)을 3으로 채워 넣기

In [ ]:
df['Name'] = df['Name'].fillna(3)
df.head(10)

## 혼자실습$3
### 수정된 Name과 채워진 Age를 확인합니다.

In [17]:
df['Name'].value_counts()

0.0    517
2.0    182
1.0    125
Name: Name, dtype: int64

In [18]:
df['Age'] = df['Age'].fillna( df.groupby('Name')['Age'].transform('mean') )
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,0.0,male,22.00000,1,0,A/5 21171,7.2500,0,S
1,2,1,1,1.0,female,38.00000,1,0,PC 17599,71.2833,0,C
2,3,1,3,2.0,female,26.00000,0,0,STON/O2. 3101282,7.9250,0,S
3,4,1,1,1.0,female,35.00000,1,0,113803,53.1000,0,S
4,5,0,3,0.0,male,35.00000,0,0,373450,8.0500,0,S
5,6,0,3,0.0,male,32.36809,0,0,330877,8.4583,0,Q
6,7,0,1,0.0,male,54.00000,0,0,17463,51.8625,3,S
7,8,0,3,NaN,male,2.00000,3,1,349909,21.0750,0,S
8,9,1,3,1.0,female,27.00000,0,2,347742,11.1333,0,S
9,10,1,2,1.0,female,14.00000,1,0,237736,30.0708,0,C